export const teresaQuotes = {
  initial: {
    id: 0,
    lines: [
      "吾等一直在注视着你。",
      "你驾驭现实之力，颇有前途。",
      "吾等乃天神，愿你加入。",
      "吾名特蕾莎，现实之天神。",
      "证明你的价值。"
    ]
  },
  unlockReality: {
    id: 1,
    lines: [
      "凡人，我允你踏入我的现实。莫要被它碾碎。"
    ]
  },
  completeReality: {
    id: 2,
    lines: [
      "你为何还在此处……你本该失败才对。"
    ]
  },
  effarig: {
    id: 3,
    lines: [
      "你仍非吾等之敌。",
      "愿他等能成就吾所未能之事。"
    ]
  },
  expansionPacks: {
    id: 4,
    lines: [
      "什么东——",
      "我身在何处？",
      "等等——",
      "你？！",
      "击败我的人……是你……",
      "多少次了？",
      "我记不清了……",
      "你们也都在这里？"
    ]
  },
  teresaPack: {
    id: 5,
    requirement: () => ExpansionPack.teresaPack.isBought,
    lines: [
      "哦，你好，毁灭者。",
      "看来你找到了我的隐秘商店。",
      "我有一事相问。",
      "你为何要击败吾等？",
      "吾等于你……不过是阻碍吗？",
      "抑或另有缘由……",
      "世事未必尽然如此，你可知道。",
      "当然，我或难改你心意。",
      "只求你莫要伤害他人。",
      "他们是我的朋友，你可知道？",
      "我想我该让你回去……做你如今所做之事。",
      "那么，后会有期。"
    ]
  },
  fullCharge: {
    id: 6,
    requirement: () => Teresa.totalCharges >= 5,
    lines: [
      "好了，最后一个也已充能完毕。",
      "不必再抉择何者充能，想必进步会更顺畅。",
      "想来这是你最后一次造访我的商店了。",
      "没有那些……你懂得的……有你在身旁甚好。",
      "毁灭。",
      "但那毕竟是你的行事之道，对吧？",
      "聚积力量，凌驾吾等之上……",
      "佩勒不会告诉你，但他已心生忧虑。",
      "忧你终将击败他。",
      "当然，他是吾等之中最强……但即便是他，也有极限。",
      "想来我或许无意间助你走向他的覆灭……",
      "但求你莫杀他，好吗？",
      "珍重。"
    ]
  }
};