export const alphaQuotes = {
  unlock: {
    id: 0,
    lines: [
      "我察觉到……",
      "有人来了……",
      "你好？",
      "等等……",
      "你是凡人？",
      "……",
      "你这般凡人如何能攀爬到我面前？",
      "直面真正的天神之力？",
      "有人帮了你，对吧？",
      "那些低级天神，对吧？",
      "还有佩勒？",
      "我早该料到。",
      "佩勒自从被我派去招募其他天神后就从不服从命令。",
      "他以为自己是领袖了。",
      "我不久便会惩戒他。",
      "眼下，我先处理你。",
      "来吧，进入我的领域。",
      "但记住这点。",
      "无处可逃。",
      "因我是阿尔法，黑暗之天神。",
      "你将再也见不到光明。"
    ]
  },
  enter: {
    id: 1,
    lines: [
      "欢迎来到我的领域。",
      "我完美的领域。",
      "唯有黑暗居于此地。",
      "进来者无人能出。",
      "来吧。",
      "但好好看看。",
      "这是最后一次光明照耀你。"
    ]
  },
  fourthDB: {
    id: 2,
    lines: [
      "所以。",
      "八个维度都完好如初。",
      "但这不过是开始。",
      "你永远无法获胜。",
      "黑暗将把你束缚得更紧。"
    ]
  },
  fifthDB: {
    id: 3,
    lines: [
      "献祭？",
      "(嗤笑)",
      "献祭于你何用？",
      "毕竟，你已失去一切。"
    ]
  },
  galaxy: {
    id: 4,
    lines: [
      "……",
      "这就是那力量……",
      "这就是摧毁佩勒与其他人的力量，对吧？",
      "星系，你独特的力量之源。",
      "不幸的是，如今这是我的舞台。",
      "你的星系将摧毁你……",
      "它们的效果将变得如此微弱。"
    ]
  },
  infinity: {
    id: 5,
    lines: [
      "你已封顶你的反物质。",
      "到此为止了。",
      "如今你重置，仅比之前稍快……",
      "挣扎无用，你的终结将至。",
      "接受失败。",
      "或许……我会让你活着。"
    ]
  },
  autoCrunch: {
    id: 6,
    lines: [
      "你以为我的现实很平常？",
      "你以为你能打破无限并获胜？",
      "哦，不。",
      "今天不行。",
      "我太强大了。",
      "我的时间墙将让你受苦！"
    ]
  },
  breakInfinity: {
    id: 7,
    lines: [
      "你！你……",
      "你以为那可怜的小升级足以阻止我？",
      "信我，你活不到看见我死的那天。",
      "诚然，你现在能产出无限的反物质……",
      "但事情并非如此。",
      "毕竟，舞台是我的。",
      "你不过是棋子，而我是棋手。",
      "你得在试图击败我之前明白这一点。",
      "若你臣服，我或许饶你一命。",
      "否则，你已是死人。"
    ]
  },
  powerGalaxies: {
    id: 8,
    lines: [
      "所以。",
      "你在试图扭转你不可避免的终结。",
      "抵抗无用，你该知道这一点。",
      "你为何不明白我已然胜了？",
      "是的，佩勒从我这里学到了那句台词。",
      "但如今已不重要。",
      "你会输，或此或彼。",
      "毕竟，唯有黑暗永存。"
    ]
  },
  allBreakUpgrades: {
    id: 9,
    lines: [
      "停下吧。",
      "让自己轻松些。",
      "你已失败。",
      "你为何不明白这一点？",
      "莫要挣扎。",
      "你的努力皆是徒劳。",
      "你的覆灭近在咫尺。"
    ]
  },
  allInfinityChalls: {
    id: 10,
    lines: [
      "你真以为这有用吗？",
      "你真以为你能赢我？",
      "你错了！",
      "你的终结临近了。",
      "准备面对它吧。"
    ]
  },
  replicanti: {
    id: 11,
    lines: [
      "你为何继续？",
      "你为何试图重建那已绝望丧失之物？",
      "你是个 fool。",
      "你必须明白，迟早你非我之敌。",
      "而我会确保你明白。"
    ]
  },
  eighthInfinityDimension: {
    id: 12,
    lines: [
      "停下！",
      "你不能这样下去！",
      "你很弱，你的努力皆是徒劳。",
      "我与其他天神不同。",
      "那些……弱者。",
      "不，我远高于他们。",
      "你无法击败我。",
      "我已然胜了。",
      "如今，我将让你受苦！"
    ]
  },
  eternity: {
    id: 13,
    lines: [
      "你真以为其他时间能救你？",
      "你不明白吗？",
      "那些时间同样被诅咒！",
      "你永远无法胜过我。"
    ]
  },
  improveEP: {
    id: 14,
    lines: [
      "现在就停下！",
      "你疯了吗？",
      "你显然是疯了，才以为这种无用的升级能救你！",
      "你还没开始感受我的愤怒！"
    ]
  },
  fourthTimeDimension: {
    id: 15,
    lines: [
      "你感觉到了，对吧？",
      "所有削弱之重压在你身上？",
      "是的，我的现实正在将代价加于你。",
      "你的进展在减缓？",
      "应该很快了。",
      "毕竟，我已然胜了。"
    ]
  },
  infinityChallTimeBoost: {
    id: 16,
    lines: [
      "你怎么还活着？",
      "这……这力量……",
      "无法阻止我。",
      "我仍将碾碎你。"
    ]
  },
  prepareEternityChalls: {
    id: 17,
    lines: [
      "够了！",
      "你为何不接受失败？",
      "你知道我胜了，然而……",
      "然而……",
      "(叹息)",
      "痛苦仍将萦绕你，小子。",
      "记住我的话。"
    ]
  },
  firstEternityChall: {
    id: 18,
    lines: [
      "才一个？",
      "哈！",
      "你不可能完成所有挑战。",
      "你会死在这里，如同无数前人。"
    ]
  },
  bulkEternityChall: {
    id: 19,
    lines: [
      "你仍在挣扎？",
      "为何？",
      "你知道你会输。",
      "你为何坚持？",
      "我已然胜了，小子。",
      "把这塞进你那厚脑子里。"
    ]
  },
  passiveIPGen: {
    id: 20,
    lines: [
      "怎么？",
      "你怎么走到这一步的？",
      "在我做了这么多之后……",
      "不！",
      "这必须停止！"
    ]
  },
  eternityChallTen: {
    id: 21,
    lines: [
      "不……",
      "你必须停下！",
      "你的进展将终结！",
      "你……",
      "你仍将倒下！"
    ]
  },
  uncapReplicanti: {
    id: 22,
    lines: [
      "别以为我放过你了！",
      "更多的苦难即将到来！",
      "记住我的话！",
      "很快……",
      "你将感受真正的痛苦。"
    ]
  },
  eternityChallEleven: {
    id: 23,
    lines: [
      "你现在明白了，对吧？",
      "这一切都是计划好的。",
      "这就是你倒下之处。",
      "如今，终于……",
      "你将受苦！",
      "哦，还有，我已然胜了。"
    ]
  },
  completeEternityChallEleven: {
    id: 24,
    lines: [
      "……",
      "怎么？",
      "你怎么做到的？",
      "我……",
      "我让它不可能完成……",
      "不！",
      "你不能继续……",
      "你不得继续！"
    ]
  },
  unlockDilation: {
    id: 25,
    lines: [
      "好了。",
      "我困住你了。",
      "你徒劳的挣扎到此为止！"
    ]
  },
  dilatedEternity: {
    id: 26,
    lines: [
      "只是……",
      "停下！",
      "你赢不了我！",
      "我对你而言太强大了！",
      "你已败了！"
    ]
  },
  ttGen: {
    id: 27,
    lines: [
      "不……",
      "你……",
      "你不能继续！"
    ]
  },
  eighthTimeDimension: {
    id: 28,
    lines: [
      "不！",
      "你赢不了！",
      "我需要……一个计划……",
      "好……",
      "你仍会输！"
    ]
  },
  reality: {
    id: 29,
    lines: [
      "……",
      "什么？？？",
      "怎么……",
      "你怎么……",
      "你怎么做到的？！！！",
      "经历了一切……",
      "我所做的一切……",
      "等等……",
      "我的力量……",
      "它在……消失？",
      "不……",
      "你在窃取它！",
      "诅咒你！",
      "凡人渣滓！",
      "我拒绝被你这种东西击败！",
      "我发誓……",
      "总有一天我会回来。",
      "而你……",
      "你和佩勒……",
      "你们将为叛逆付出代价。",
      "这事没完，凡人渣滓。",
      "终结会降临于你。",
      "你等着瞧……",
      "你们所有人……都会看到……",
      "……"
    ]
  }
};