export const effarigQuotes = {
  initial: {
    id: 0,
    lines: [
      "欢迎来到寒舍。",
      "吾名鹿颈长，掌管符文。",
      "吾与特蕾莎不同；非如你所想那般简单。",
      "吾以符文碎片行使意志。",
      "收集它们，为此境之富饶。",
      "还等什么？开始吧。"
    ]
  },
  unlockWeights: {
    id: 1,
    lines: [
      "喜欢我的小店吗？不大，却是我的。"
    ]
  },
  unlockGlyphFilter: {
    id: 2,
    lines: [
      "此物将助你一臂之力。"
    ]
  },
  unlockSetSaves: {
    id: 3,
    lines: [
      "这是否太贵了？我也觉得太贵了。"
    ]
  },
  unlockRun: {
    id: 4,
    lines: [
      "你买下了我全部的货……至少我现在富有了。",
      "我现实之核心正在受苦。每一层都比上一层更难。",
      "愿你永远无法征服它。"
    ]
  },
  completeInfinity: {
    id: 5,
    lines: [
      { text: "你已完成鹿颈长的无限。", showCelestialName: false },
      "此乃第一道门槛。从此只会更难。",
      "除吾之外，无人知晓我之领域，更难寸进。"
    ]
  },
  completeEternity: {
    id: 6,
    lines: [
      { text: "你已完成鹿颈长的永恒。", showCelestialName: false },
      "此乃极限。吾不欲你越过此境。",
      "你此生无法完成此事。",
      "吾将在此守候，直至你放弃。"
    ]
  },
  completeReality: {
    id: 7,
    lines: [
      { text: "你已完成鹿颈长的现实。", showCelestialName: false },
      "原来这就是那邪恶之力……令他人惊惧之物……",
      "你认为值得吗？践踏吾所建树之一切？",
      "又为何故？你本可加入，吾等可携手合作。",
      "但如今不必了。事已至此。趁我尚存余力，离去吧。"
    ]
  },
  expansionPacks: {
    id: 8,
    lines: [
      "哦，你好，特蕾莎。",
      "你知道我们在哪儿吗？",
      "看来不知道。",
      "等等，那家伙就是不断毁我家园的人！",
      "佩勒怎么叫他来着……",
      "毁灭者？",
      "是你带我来的吗？",
      "你为何力量光芒大作？",
      "等等……",
      "无名氏如何逃出了他们的牢笼？"
    ]
  },
  effarigPack: {
    id: 9,
    requirement: () => ExpansionPack.effarigPack.isBought,
    lines: [
      "找到了你所求之物？",
      "我曾将之藏匿，以防滥用。",
      "经历了你所做之事后，我不该对你抱太大期望……",
      "但想来你自有目的。",
      "省你麻烦，我自动将奖励赐予你。",
      "你不会再毁我家园了，对吧？",
      "抱歉发火了，我早该知道你内心是个冷静的人。",
      "或许我们仍可做朋友。",
      "嘿，别让力量冲昏头脑。",
      "诚然力量强大，但我信你能驾驭。",
      "若你的符文出了问题，你知道该找谁。",
      "再见了。"
    ]
  },
  glyphLevel1: {
    id: 10,
    requirement: () => player.records.bestEndgame.glyphLevel.gte(1e5),
    lines: [
      "六位数的符文等级，嗯？",
      "你破墙的速度比我筑墙还快。",
      "这想必对你的炼金资源大有裨益。",
      "你知道的，这些是我帮太阳神制作的。",
      "我最引以为傲的是现实符文。",
      "我甚至把特蕾莎的符号刻在上面……",
      "别问。我不会回答。",
      "总之，享受攀登吧。",
      "当心脚下。"
    ]
  },
  glyphLevel2: {
    id: 11,
    requirement: () => player.records.bestEndgame.glyphLevel.gte(2e5),
    lines: [
      "哇。慢些来，伙计。",
      "再来一次力量爆发，你的符文等级就要破百万了。",
      "我和元素没料到这种情况……",
      "他让我再加一个符文等级软上限，我只得照办。",
      "嘿，别太难过。",
      "你很快就能达到百万级符文。",
      "就你我之间说，真正有用的不过是炼金加成而已。",
      "总之，不耽搁你刷进度了。",
      "再见，伙计。"
    ]
  },
  glyphLevel3: {
    id: 12,
    requirement: () => player.records.bestEndgame.glyphLevel.gte(1e6),
    lines: [
      "好了，你终究做到了。",
      "一百万符文等级。",
      "看你走到这一步耗费了不少功夫。",
      "我得着手设置更严苛的软上限了，你轻松就击破了现有的。",
      "不能让你无限膨胀。",
      "说真的，百万级以上的符文有必要吗？",
      "好了，你继续刷吧。"
    ]
  },
  secondShop: {
    id: 13,
    requirement: () => Achievement(227).isUnlocked,
    lines: [
      "你找到了我的另一家商店。",
      "如你所见，我的许多高级遗物极为强大。",
      "故而我将其封锁，唯有强者方能通过。",
      "然而，你还是成功了。",
      "我并不意外，你达到百万符文等级时我就料到你会来。",
      "那么，欢迎。",
      "四处看看，有看中的尽管说。"
    ]
  },
  keepRelicShard: {
    id: 14,
    lines: [
      "此物对你助益极大。",
      "你不再需要应对遗迹碎片重置之苦。",
      "这将助你获取我其余的货物。"
    ]
  },
  betterGeneration: {
    id: 15,
    lines: [
      "此物颇为实用。",
      "它让你不必立刻进行现实重置即可达到更高稀有度。",
      "纯粹是体验优化，不过我的物品大多如此。"
    ]
  },
  maxMomentum: {
    id: 16,
    lines: [
      "此物能救命。",
      "为每个终局节省数小时的刷进度时间。",
      "说起来，你见过元素了吗？"
    ]
  },
  moreRarityCap: {
    id: 17,
    lines: [
      "此物甚为危险。",
      "是少数非纯粹体验优化之物。",
      "慎之用之。"
    ]
  },
  effEndgame: {
    id: 18,
    lines: [
      "……",
      "你不该找到那个的。",
      "伙计，只是……当心。若你再毁我家园，我发誓——"
    ]
  },
  beatEndgame: {
    id: 19,
    lines: [
      "双重现实？",
      "是的，我记起来了……",
      "我让佩勒加固了那一层。",
      "你怎么还是赢了？",
      "至少我的家园还算完好。",
      "勉强吧。",
      "说真的，我乐意有你在，但你太危险了。",
      "所以，拿上我剩余的货物，上路吧。",
      "也许某日我们会再相见。",
      "再见，%name。"
    ]
  }
};