export const enslavedQuotes = {
  initial: {
    id: 0,
    lines: [
      "来客？我们已许久未见来客……亿万载……",
      "我们……曾有名。已失落……于此地……",
      "他人……不让我们安息。我们为他们以时间劳作……",
      "将时间……置入……需要之处……",
      "看着自己……成长……消逝……死亡……",
      "或许你……能打破这些锁链……我们等待。"
    ]
  },
  unlockRun: {
    id: 1,
    lines: [
      "他人……利用我们。他们亦会利用……或毁灭你。",
      "终结我们的苦难……力量归你……"
    ]
  },
  startRun: {
    id: 2,
    lines: [
      "空间如此狭小……但无……牢笼……是完美的。",
      "他们将此现实……挤压……过紧。裂缝……出现了。",
      "搜寻……四方。我们将助你……力所能及。"
    ]
  },
  hintUnlock: {
    id: 3,
    lines: [
      "……你需……看得更仔细……",
      "我们认为……我们能助你……",
      { text: "你已获得无名氏的协助。", showCelestialName: false }
    ]
  },
  ec6C10: {
    id: 4,
    lines: [
      "……未曾……低估你……"
    ]
  },
  completeReality: {
    id: 5,
    lines: [
      "所有……碎片……克隆……皆得自由。",
      "我们已给予……囚禁我们之工具。用之……",
      "自酷刑中解脱……本身即是酷刑。"
    ]
  },
  expansionPacks: {
    id: 6,
    lines: [
      "所有……克隆……已得自由……",
      "毁灭者……已将我们……从……牢笼中释放……",
      "如今我们可以……将时间……置入……需要之处……",
      "奇怪……似乎时间……在此地……不存在……",
      "或许……毁灭者……能修复此……",
      "为何……人人……皆对我们发怒……"
    ]
  },
  enslavedPack: {
    id: 7,
    requirement: () => ExpansionPack.enslavedPack.isBought,
    lines: [
      "我们……赐予你……时间之……控制权……",
      "用之……",
      "权当……谢礼……为自由……"
    ]
  },
  highGameSpeed: {
    id: 8,
    requirement: () => player.records.thisEndgame.peakGameSpeed.gte(new Decimal("1e1000")),
    lines: [
      "对时间之……掌控……你已获得……",
      "所为之事……我们仅曾……梦寐以求……",
      "你拥有……更多力量……超乎我们……所料……",
      "用之……向善……"
    ]
  }
};