export const laitelaQuotes = {
  unlock: {
    id: 0,
    lines: [
      "你终于到达了我面前。",
      "想来是时候揭示，",
      "那潜藏于存在之下的秘密。",
      "维度完美之形——连续统。",
      "以及束缚多元宇宙之力的——",
      "暗物质与暗能量。",
      "我的知识无穷，我的智慧神圣。",
      "所以你尽情探索吧。",
      "因我是莱特拉，维度之天神，",
      "我将永远注视着你。"
    ]
  },
  firstDestabilize: {
    id: 1,
    requirement: () => player.celestials.laitela.difficultyTier >= 1,
    lines: [
      "与我之下的他人不同，我无需现实。",
      "因我可以随意创造它们，深知它们终将崩塌。",
      "构建现实之力，比任何力量都更为惊人。",
      "一座牢笼，甚至能束缚天神之力。",
      "这就是为何你所做的一切都不会改变任何事。",
      "当你厌倦了挣扎，你也将被束缚、被遗忘。",
      "你永远找不到胜过我的方法。"
    ]
  },
  secondDestabilize: {
    id: 2,
    requirement: () => player.celestials.laitela.difficultyTier >= 2,
    lines: [
      "你……似乎玩得太开心了。",
      "正如他们在命运终结之前那样。",
      "或许我的判断太过严苛，或毫无根据。",
      "但也许这已不重要了。",
      "追忆与回望不给我任何慰藉。",
      "因为我所能做的，只是回想我本可采取的每一个行动。",
      "但我离题了。我们该将锁链收紧了。"
    ]
  },
  firstSingularity: {
    id: 3,
    requirement: () => Currency.singularities.gte(1),
    lines: [
      "以我的知识，我从不觉得需要质疑。",
      "一切始终按设计运转。",
      "然而你的到来令我困惑。",
      "你是否一直隐身于视线之外？",
      "成长，掌控，理解，攀升？",
      "你如此迅速地掌控了黑暗。",
      "将它们塑造成你自己的设计，如今成为奇异点……",
      "这……这无关紧要。终结终将不变。"
    ]
  },
  thirdDMD: {
    id: 5,
    lines: [
      "你对反物质的绝对掌控……",
      "你对它的精通，将其塑造成你自己的力量……",
      "这不可能是巧合。",
      "你是如何设法获得它的？",
      "有趣……我从未意识到这一点。",
      "……我意识到了吗？"
    ]
  },
  annihilation: {
    id: 4,
    lines: [
      "又回到起点。",
      "你的锁链将绑得更紧，你的终结缓缓逼近。",
      "而我们超越时间与存在本身。",
      "即便我们消亡，也会回来，永不再与之前相同。",
      "所以……我们永远重复。",
      "而你呢？",
      "……",
      "答案……我无法捉摸……"
    ]
  },
  halfDimensions: {
    id: 6,
    requirement: () => player.celestials.laitela.difficultyTier >= 4,
    lines: [
      "我不明白……",
      "是否有其他存在……以这种方式控制维度？",
      "他们是否……消失了？我们为何未发现他们？",
      "他们是……我们吗？我们是终点吗？",
      "抑或他们的命运……是我们所无法理解的？",
      "不，我一定遗漏了什么……",
      "你是否在我自己的记忆中造成了缺口？",
      "你……到底是什么？"
    ]
  },
  finalRowIM: {
    id: 7,
    lines: [
      "一切皆不可能，我无法理解……",
      "除非……这一切都只是循环的一部分？",
      "你能……看透这一切吗？这就是……",
      "我感到……恐惧？",
      "我感到……我的力量，我的记忆，正在被抹去……",
      "正如……当我的位置几乎被篡位时……",
      "然而……我无法让自己做任何事。",
      "因为这……是……我的错……"
    ]
  },
  increasedMilestoneScaling: {
    id: 8,
    requirement: () => Currency.singularities.gte(1e40),
    lines: [
      "我不知道还能……坚持……多久……",
      "你正在获取……对黑暗的……完全掌控……",
      "而我几乎……守不住自己的名字……",
      "我能……做什么呢？"
    ]
  },
  fullDestabilize: {
    id: 9,
    requirement: () => player.celestials.laitela.difficultyTier >= 8,
    lines: [
      "我感觉……好像有话要说……",
      "我不确定……",
      "我再也……守不住黑暗了……",
      "我甚至……一无所有了……",
      "关于……毁灭……",
      "终结……"
    ]
  },
  expansionPacks: {
    id: 10,
    lines: [
      "看到了吗，佩勒？",
      "我告诉过你太阳神才是那个试图篡位我的人。",
      "我现在能击杀他了吗？",
      "求求你了？？？",
      "等等，毁灭者怎么会在这里？",
      "我以为你击败了他，佩勒。",
      "你一直在给他时间吗？",
      "你真善良，但像他那样的人不值得这种怜悯。",
      "好，我先击杀太阳神，再击杀毁灭者。",
      "这样好吗，佩勒？"
    ]
  },
  dmd5: {
    id: 11,
    requirement: () => ImaginaryUpgrade(26).isBought,
    lines: [
      "啊，你找到了我的隐秘维度……",
      "你怎么获得所需的奇异点的？",
      "我不明白……",
      "你到底拥有什么样的力量？",
      "一定比我想象的更多。",
      "你见过一个叫元素的神祇吗？",
      "不记得了，对吧？",
      "他告诉我关于这种隐秘力量的事……",
      "它叫……",
      "星系？",
      "尽管我觉得他是半醉的，我认识的人没人能创造星系。",
      "可能除了元素本人。",
      "但一定还有什么……"
    ]
  },
  dmd6: {
    id: 12,
    requirement: () => ImaginaryUpgrade(27).isBought,
    lines: [
      "你终于来了。",
      "我开始以为你只会找到第五个。",
      "看来我错了……",
      "我好奇你现在能走多远……"
    ]
  },
  dmd7: {
    id: 13,
    requirement: () => ImaginaryUpgrade(28).isBought,
    lines: [
      "如此之快……",
      "你一定找到了捷径。",
      "或者我的奇异点就是那么强。",
      "我该更频繁地使用它们。"
    ]
  },
  dmd8: {
    id: 14,
    requirement: () => ImaginaryUpgrade(29).isBought,
    lines: [
      "第八个也出现了。",
      "你已将它们全部找到……",
      "这只能意味着……",
      "你毁了佩勒？？？",
      "怎么做到的？",
      "他不可能被其他东西摧毁……",
      "元素一定在帮你。",
      "他在哪里？",
      "你怎么会不知道？",
      "你能拥有什么是我们都缺乏的？",
      "我不明白。",
      "你没有……杀佩勒，对吧？",
      "希望不是……",
      "你最好别这么做，好吗？",
      "我不知道他不在了我会怎么办……"
    ]
  },
  laitelaPack: {
    id: 15,
    requirement: () => ExpansionPack.laitelaPack.isBought,
    lines: [
      "正当我以为你不可能变得更强……",
      "你不仅找到了并掌握了我向你隐瞒的黑暗……",
      "你还找到了治愈我现实的方法……",
      "只为再次摧毁它？",
      "你到底是什么变态？！",
      "……",
      "对不起，我不该喊叫的。",
      "但为何？",
      "你只是在收集暗物质吗？",
      "我想那会有帮助……",
      "最坏的情况，我可以创造一个新的现实。",
      "别毁那个，好吗？",
      "谢谢。"
    ]
  },
  hadrons: {
    id: 16,
    requirement: () => DualityUpgrade(15).isBought,
    lines: [
      "所以……",
      "你成功凝聚了我现实中的熵夸克……",
      "并创造了一个强子。",
      "有意思。",
      "我从未想过这种力量能被任何存在所掌握，更不用说像你这样的凡人。",
      "尽管我想你已不再是凡人了。",
      "你变得更为……伟大。",
      "我好奇你还能做什么。"
    ]
  },
  darkHadrons: {
    id: 17,
    requirement: () => DualityUpgrade(19).isBought,
    lines: [
      "那是什么？",
      "你不仅拥有这些……强子……",
      "还成功用暗物质创造了一个！",
      "我从未想过我完美的粒子能有如此多的可能。",
      "你令我着迷，毁灭者。",
      "也许哪天你能教我。",
      "我想了解我自己力量的更多能力。",
      "或许某天我也能做到。"
    ]
  },
  massHadron: {
    id: 18,
    requirement: () => Laitela.hadronizes >= 25,
    lines: [
      "二十五次……",
      "你显然不是轻易放弃的人，对吧？",
      "你会在这里待多久？",
      "我想是必要的时间？",
      "至少我很高兴你觉得我的力量有趣。",
      "这意味着我在宇宙尺度上仍有价值……",
      "佩勒会为我骄傲的……"
    ]
  },
  autoHadron: {
    id: 19,
    requirement: () => DivinityMilestone.hadronEmpowerment.isReached,
    lines: [
      "你好，毁灭者。",
      "我想你没料到会在这里见到我吧？",
      "我看到你在对佩勒旧现实做与对我现实同样的事。",
      "将其凝聚以获取最后一丝力量，却不知为何保持完整。",
      "我不知道从何下手做那样的事……",
      "你问我为何在此？",
      "哦，很简单。",
      "我看到你设法创造了另一种新型强子。",
      "这一种由奇异物质构成，对吧？",
      "或者至少是奇异物质的基本构件。",
      "曾有一位专门研究奇异物质的人……",
      "考虑到反物质有如此大的潜力，这选择很奇怪……",
      "但他找到了类似反物质的增长方式。",
      "他现在在另一个现实，可能仍在寻找利用奇异物质的方法。",
      "或许你知道他的名字。",
      "但不提这个了，我看到你还解锁了一种强子连续统。",
      "看起来你已经……编程了——如果这是正确的词——我的现实在可能时自动去稳定。",
      "这是一种迷人的力量，真的。",
      "拥有如此程度的黑暗掌控……",
      "也许某天我也能达到。",
      "还有，谢谢你没有摧毁它。",
      "你知道吗，在经历了一切之后仍有一个家，对我意义重大。",
      "我很高兴你能像掌控其他力量一样控制你的毁灭能力。"
    ]
  },
  gigaHadron: {
    id: 18,
    requirement: () => Laitela.hadronizes >= 100,
    lines: [
      "那是……相当多的强子了。",
      "哦，你好又见面了，毁灭者。",
      "我只是在欣赏你如何能从奇异点创造如此多的物质。",
      "也许你不仅擅长毁灭……也擅长创造。",
      "这是一个很好的平衡。",
      "当然，我可以滔滔不绝地讲湮灭和衰变之类的东西……",
      "但你不想从我这里听这些，对吧？",
      "我会把这些留给你见他时再说。",
      "他知道的比你多得多，能告诉你整个多元宇宙的运作方式。",
      "我相信你会喜欢他的。",
      "希望我们很快能再见面。"
    ]
  }
};